STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA55CG/Applications/Zigbee/Zigbee_OnOff_Client_Router_FreeRtos/STM32_WPAN/App/app_zigbee.c
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * File Name          : app_zigbee.c
  * Description        : Zigbee Application common code.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include <assert.h>
#include <stdint.h>

#include "app_common.h"
#include "app_conf.h"
#include "log_module.h"
#include "app_entry.h"
#include "app_zigbee.h"
#include "app_zigbee_endpoint.h"
#include "dbg_trace.h"
#include "ieee802154_enums.h"
#include "mcp_enums.h"

#include "stm32_rtos.h"
#include "stm32_timer.h"

#include "zigbee.h"
#include "zigbee.nwk.h"
#include "zigbee.security.h"

#include "zcl/zcl.h"

/* Private includes -----------------------------------------------------------*/
/* USER CODE BEGIN PI */
#include "app_bsp.h"

/* USER CODE END PI */

/* Public variables -----------------------------------------------------------*/
ZigbeeAppInfo_t                                     stZigbeeAppInfo;

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Private defines -----------------------------------------------------------*/
#define APP_ZIGBEE_BLINK_LED_DELAY                  1000u             // Time (in ms) between two Led Blinck during the Startup/Join (up to 17 s).
#define APP_ZIGBEE_STARTUP_WAIT_DELAY               ( 60u * 1000u )   // Time (in ms) to wait the finish Join (60 seconds).
#define APP_ZIGBEE_STARTUP_FAIL_DELAY               500u              // Time (in ms) between two tentative to Join a Coord/Router.

/* Defines for Basic Cluster Server */
#define APP_ZIGBEE_MFR_NAME                         "STMicroelectronics"
#define APP_ZIGBEE_CHIP_NAME                        "STM32WBA"
#define APP_ZIGBEE_CHIP_VERSION                     0x20        // Cut 2.0
#define APP_ZIGBEE_BOARD_POWER                      0x00        // No Power

#define APP_ZIGBEE_APP_DATE_CODE                    "20260301"
#define APP_ZIGBEE_APP_BUILD_ID                     "V1.9"
#define APP_ZIGBEE_APP_VERSION                      0x19                    // Application Version v1.9
#define APP_ZIGBEE_STACK_VERSION                    ( ( 26u << 2u ) | 1u )  // Stack Version 2026.1

/* USER CODE BEGIN PD */

/* USER CODE END PD */

/* Private constants ---------------------------------------------------------*/
/* USER CODE BEGIN PC */

/* USER CODE END PC */

/* Private function prototypes -----------------------------------------------*/
static void APP_ZIGBEE_ConfigBasicServer              ( void );
static void APP_ZIGBEE_TraceError                     ( const char * pMess, uint32_t lErrCode );
static void APP_ZIGBEE_ConfigMeshNetwork              ( void );
static void APP_ZIGBEE_ZbCallbackTimeOutTimerCallback ( void * arg );
static void APP_ZIGBEE_ZbRestartJoinTimerCallback     ( void * arg );
static void APP_ZIGBEE_BlinckLedTimerCallback         ( void * arg );
static void APP_ZIGBEE_Printf                         ( struct ZigBeeT * zb, uint32_t lMask, const char * pHeader, const char * pFrame, va_list argptr );

static enum zb_msg_filter_rc APP_ZIGBEE_DeviceJointCallback   ( struct ZigBeeT * zb, uint32_t lId, void * pMessage, void * arg );

static void APP_ZIGBEE_NwkFormOrJoinTask      ( void *argument );

/* USER CODE BEGIN PFP */

/* USER CODE END PFP */

/* Private variabless -----------------------------------------------*/
static UTIL_TIMER_Object_t      stZbCallbackTimeOutTimer, stZbRestartJoinTimer, stBlinckLedTimer;

osSemaphoreId_t                 EndWaitCallbackSemaphore;
osSemaphoreId_t                 NwkFormStartSemaphore;
osSemaphoreId_t                 NwkFormRestartWaitEndSemaphore;
osThreadId_t                    NwkFormJoinTask;

static const osThreadAttr_t stNwkFormJoinTask_attributes =
{
  .name         = "NwkFormJoin Task",
  .priority     = TASK_PRIO_ZIGBEE_NETWORK_FORM,
  .stack_size   = TASK_STACK_SIZE_ZIGBEE_NETWORK_FORM,
  .attr_bits    = TASK_DEFAULT_ATTR_BITS,
  .cb_mem       = TASK_DEFAULT_CB_MEM,
  .cb_size      = TASK_DEFAULT_CB_SIZE,
  .stack_mem    = TASK_DEFAULT_STACK_MEM
};

/* USER CODE BEGIN PV */

/* USER CODE END PV */

/* Functions Definition ------------------------------------------------------*/

/**
 * @brief  Initialize 'Network Form or Join' Task
 *
 * @param  None
 * @retval None
 */
void APP_ZIGBEE_NwkFormOrJoinTaskInit( void )
{
  /* First, create the Timer service to indicate end of a Callback */
  UTIL_TIMER_Create( &stZbCallbackTimeOutTimer, 0, UTIL_TIMER_ONESHOT, &APP_ZIGBEE_ZbCallbackTimeOutTimerCallback, NULL );
  UTIL_TIMER_Create( &stZbRestartJoinTimer, 0, UTIL_TIMER_ONESHOT, &APP_ZIGBEE_ZbRestartJoinTimerCallback, NULL );

  if ( stZigbeeAppInfo.eStartupControl == ZbStartTypeJoin )
  {
    /* Create the Timer service to can advertise user during the time of the Join (by default 17 seconds) */
    UTIL_TIMER_Create( &stBlinckLedTimer, APP_ZIGBEE_BLINK_LED_DELAY, UTIL_TIMER_PERIODIC, &APP_ZIGBEE_BlinckLedTimerCallback, NULL );

    /* Launch Blue Led Blink during Join */
    UTIL_TIMER_Start( &stBlinckLedTimer );
  }

  /* Create Application FreeRTOS objects */
  NwkFormStartSemaphore = osSemaphoreNew( 1U, 0U, NULL );
  NwkFormRestartWaitEndSemaphore = osSemaphoreNew( 1U, 0U, NULL );
  EndWaitCallbackSemaphore = osSemaphoreNew( 1U, 0U, NULL );

  NwkFormJoinTask = osThreadNew( APP_ZIGBEE_NwkFormOrJoinTask, NULL, &stNwkFormJoinTask_attributes );

  if ( ( NwkFormJoinTask == NULL ) || ( NwkFormStartSemaphore == NULL ) || ( NwkFormRestartWaitEndSemaphore == NULL ) || ( EndWaitCallbackSemaphore == NULL ) )
  {
    LOG_ERROR_APP( "Network Join FreeRtos objects creation FAILED" );
    Error_Handler();
  }

  /* launch the startup of the mesh network setup */
  osSemaphoreRelease( NwkFormStartSemaphore );
}

/**
 * @brief  Configure Zigbee Basic Server Cluster
 *
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_ConfigBasicServer( void )
{
  static struct ZbZclBasicServerDefaults   stBasicServerDefaults;

  /* Initialize Basic Server Cluster 'defaults' information */
  memset( &stBasicServerDefaults, 0x00, sizeof(stBasicServerDefaults) );

