STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA55CG/Applications/Zigbee/Zigbee_OnOff_Client_Router_FreeRtos/STM32_WPAN/App/app_zigbee.c
  stBasicServerDefaults.mfr_name[0] = strlen( APP_ZIGBEE_MFR_NAME );
  memcpy( &stBasicServerDefaults.mfr_name[1], APP_ZIGBEE_MFR_NAME, strlen( APP_ZIGBEE_MFR_NAME ) );

  stBasicServerDefaults.model_name[0] = strlen( APP_ZIGBEE_CHIP_NAME );
  memcpy( &stBasicServerDefaults.model_name[1], APP_ZIGBEE_CHIP_NAME, strlen( APP_ZIGBEE_CHIP_NAME ) );

  stBasicServerDefaults.date_code[0] = strlen( APP_ZIGBEE_APP_DATE_CODE );
  memcpy( &stBasicServerDefaults.date_code[1], APP_ZIGBEE_APP_DATE_CODE, strlen( APP_ZIGBEE_APP_DATE_CODE ) );

  stBasicServerDefaults.sw_build_id[0] = strlen( APP_ZIGBEE_APP_BUILD_ID );
  memcpy( &stBasicServerDefaults.sw_build_id[1], APP_ZIGBEE_APP_BUILD_ID, strlen( APP_ZIGBEE_APP_BUILD_ID ) );

  /* Version are on 8 bits : 4 MSB for Major and 4 LSB for Minor, except for stack : 6 MSB for Major and 2 LSB for Minor */
  stBasicServerDefaults.app_version = (uint8_t) APP_ZIGBEE_APP_VERSION;
  stBasicServerDefaults.hw_version = (uint8_t) APP_ZIGBEE_CHIP_VERSION;
  stBasicServerDefaults.stack_version = (uint8_t) APP_ZIGBEE_STACK_VERSION;

  stBasicServerDefaults.power_source = APP_ZIGBEE_BOARD_POWER;

  /* Configure default Basic Server */
  ZbZclBasicServerConfigDefaults( stZigbeeAppInfo.pstZigbee , &stBasicServerDefaults );
}

/**
 * @brief  Initialize Zigbee stack layers
 *
 * @param  None
 * @retval None
 */
void APP_ZIGBEE_StackLayersInit( void )
{
  LOG_INFO_APP( "StackLayers Init (startupMode = %d)", stZigbeeAppInfo.eStartupControl );

  /* Initialise Zigbee */
  stZigbeeAppInfo.pstZigbee = ZbInit( stZigbeeAppInfo.dlExtendedAddress, NULL, NULL );
  assert(stZigbeeAppInfo.pstZigbee != NULL);

  /* Get the Extended Address if based on HW MAC Address */
  if (  stZigbeeAppInfo.dlExtendedAddress == 0u )
  {
    stZigbeeAppInfo.dlExtendedAddress = ZbExtendedAddress( stZigbeeAppInfo.pstZigbee );
  }

  /* Configure Zigbee Logging with log Error/Warning/Info/Debug */
  ZbSetLogging( stZigbeeAppInfo.pstZigbee, ZIGBEE_CONFIG_LOG_LEVEL, APP_ZIGBEE_Printf );

  /* Configure Application Basic Server */
  APP_ZIGBEE_ConfigBasicServer();

  /* Create the endpoint and cluster(s) */
  APP_ZIGBEE_ConfigEndpoints();

  /* USER CODE BEGIN APP_ZIGBEE_StackLayersInit1 */
  /* All Led Off at startup */
  APP_LED_OFF(LED_JOIN);
  APP_LED_OFF(LED_WORK);
  APP_LED_OFF(LED_OK);

  /* USER CODE END APP_ZIGBEE_StackLayersInit1 */

  /* Configure the joining parameters */
  stZigbeeAppInfo.eJoinStatus = ZB_ZDP_STATUS_TIMEOUT;  /* Init to error status */
  stZigbeeAppInfo.lJoinDelay = HAL_GetTick();           /* Now */

  /* Initialization Complete */
  stZigbeeAppInfo.bHasInit = true;

  /* Print Application information */
  APP_ZIGBEE_PrintApplicationInfo();

  /* Create the NwkFormOrJoin Task */
  if ( stZigbeeAppInfo.bNwkStartup != false )
  {
    APP_ZIGBEE_NwkFormOrJoinTaskInit();
  }
}

/**
 * @brief  Callback triggered when the Callback Timer expire
 *
 * @param  arg : Not used
 * @retval None
 */
static void APP_ZIGBEE_ZbCallbackTimeOutTimerCallback( void * arg )
{
  UNUSED( arg );

  stZigbeeAppInfo.eJoinStatus = ZB_ZDP_STATUS_TIMEOUT;

  osSemaphoreRelease( EndWaitCallbackSemaphore );
}

/**
 * @brief  Callback triggered when the ZbStartup answer
 *
 * @param  eZbStatus :
 * @param  pCallBackArg :
 * @retval None
 */
static void APP_ZIGBEE_ZbStartupCallback( enum ZbStatusCodeT eZbStatus, void * pCallBackArg )
{
  UTIL_TIMER_Stop( &stZbCallbackTimeOutTimer );

  stZigbeeAppInfo.eJoinStatus = eZbStatus;

  osSemaphoreRelease( EndWaitCallbackSemaphore );
}

/**
 * @brief  Callback triggered when the Restart Join Timer expire
 *
 * @param  arg : Not used
 * @retval None
 */
void APP_ZIGBEE_ZbRestartJoinTimerCallback( void * arg )
{
    osSemaphoreRelease( NwkFormRestartWaitEndSemaphore );
}

/**
 * @brief  Wait a Callback
 *
 * @param  lTimeOut    Maximum time to wait Callback.
 * @retval None
 */
static void APP_ZIGBEE_WaitForCallback( uint32_t lTimeOut )
{

  UTIL_TIMER_StartWithPeriod( &stZbCallbackTimeOutTimer, lTimeOut );

  /* Wait Callback finished */
  osSemaphoreAcquire( EndWaitCallbackSemaphore, osWaitForever );
}

/**
 * @brief  Callback triggered when the Blinck Led Timer expire
 *
 * @param  arg : Not used
 * @retval None
 */
static void APP_ZIGBEE_BlinckLedTimerCallback( void * arg )
{
  /* USER CODE BEGIN APP_ZIGBEE_BlinckLedTimerCallback */
  APP_LED_TOGGLE( LED_JOIN );

  /* USER CODE END APP_ZIGBEE_BlinckLedTimerCallback */
}

/**
 * @brief  Handle Zigbee network forming and joining
 *
 * @param  None
 * @retval None
 */
void APP_ZIGBEE_NwkFormOrJoin(void)
{
  enum ZbStatusCodeT  eStatus = ZB_ZDP_STATUS_TIMEOUT;
  struct ZbStartupT   stConfig;

  while ( eStatus != ZB_STATUS_SUCCESS )
  {
    /* Application configure Startup */
    APP_ZIGBEE_GetStartupConfig( &stConfig );

    if ( eStatus != ZB_STATUS_SUCCESS )
    {
      /* Start Zigbee Stack & Form/Join network */
      stZigbeeAppInfo.eJoinStatus = ZB_ZDP_STATUS_TIMEOUT;
      eStatus = ZbStartup( stZigbeeAppInfo.pstZigbee, &stConfig, APP_ZIGBEE_ZbStartupCallback, NULL );
      if ( eStatus == ZB_STATUS_SUCCESS )
      {
        APP_ZIGBEE_WaitForCallback( APP_ZIGBEE_STARTUP_WAIT_DELAY );
        eStatus = stZigbeeAppInfo.eJoinStatus;
      }
    }

    if ( eStatus == ZB_STATUS_SUCCESS )
    {
      stZigbeeAppInfo.lJoinDelay = 0u;
      stZigbeeAppInfo.bInitAfterJoin = true;

      if ( stZigbeeAppInfo.eStartupControl == ZbStartTypeForm )
        { LOG_INFO_APP( "Mesh network created." ); }
      else
      {
        LOG_INFO_APP( "Association accepted." );

        /* Stop Blue Led Blink during Join */
        UTIL_TIMER_Stop( &stBlinckLedTimer );
      }

      /* USER CODE BEGIN APP_ZIGBEE_NwkFormOrJoin */
      APP_LED_ON( LED_JOIN );

      /* USER CODE END APP_ZIGBEE_NwkFormOrJoin */

      /* Start Applications */
      APP_ZIGBEE_ConfigMeshNetwork();
      APP_ZIGBEE_ApplicationStart();
    }
    else
    {
      LOG_INFO_APP( "Startup Wait Callback Status : 0x%02X", stZigbeeAppInfo.eJoinStatus );
      LOG_INFO_APP( "Startup failed, attempting again after a short delay (%d ms)", APP_ZIGBEE_STARTUP_FAIL_DELAY );

      /* If Device, reset ZigBee data to be sure that start with good data */
      if ( stZigbeeAppInfo.eStartupControl == ZbStartTypeJoin )
      {
        ZbReset( stZigbeeAppInfo.pstZigbee );
      }

      UTIL_TIMER_StartWithPeriod( &stZbRestartJoinTimer, APP_ZIGBEE_STARTUP_FAIL_DELAY );

      /* Wait Restart Wait finished */
      osSemaphoreAcquire( NwkFormRestartWaitEndSemaphore, osWaitForever );
    }
  }
}

/**
 * @brief  Handle Zigbee network forming and joining task for FreeRtos
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_NwkFormOrJoinTask( void * argument )
{
  UNUSED( argument );

  for(;;)
  {
    osSemaphoreAcquire( NwkFormStartSemaphore, osWaitForever );
    APP_ZIGBEE_NwkFormOrJoin();
  }
}

/**
 * @brief  Handle Zigbee network forming and joining
 * @param  None
 * @retval None
 */
static void APP_ZIGBEE_ConfigMeshNetwork(void)
{
  bool      bReturn;
  uint32_t  lBroadcastTimeOut = 3;

  stZigbeeAppInfo.bInitAfterJoin = false;

  /* Assign ourselves to the group addresses */
  bReturn = APP_ZIGBEE_ConfigGroupAddr();

  /* If we're using group addressing (broadcast), shorten the broadcast timeout */
  if ( bReturn != false )
  {
    ZbNwkSet( stZigbeeAppInfo.pstZigbee, ZB_NWK_NIB_ID_NetworkBroadcastDeliveryTime, &lBroadcastTimeOut, sizeof( lBroadcastTimeOut ) );
  }

  /* If Coord or Router, start the possibility to know where a 'Device' (End Device ou Router) Join the Network */
  if ( stZigbeeAppInfo.eStartupControl == ZbStartTypeForm )
  {
    ZbMsgFilterRegister( stZigbeeAppInfo.pstZigbee, ZB_MSG_FILTER_JOIN_IND, ZB_MSG_DEFAULT_PRIO, APP_ZIGBEE_DeviceJointCallback, NULL );
  }
}

/**
 * @brief Callback called every time a new Device (Router ou EndDevice) join the Network.
 *        Information around the Device (Address & Capability) are sent on 'APP_ZIGBEE_NewDevice()' function.
 * @param zb        Zigbee stack handler
 * @param lId       Type of filter Message
 * @param pMessage  Pointer on Message information
 * @param arg       Pointer on User Argument.
 */
static enum zb_msg_filter_rc APP_ZIGBEE_DeviceJointCallback( struct ZigBeeT * zb, uint32_t lId, void * pMessage, void * arg )
{
  struct ZbNlmeJoinIndT * pstJoinMessage;

  if ( lId == ZB_MSG_FILTER_JOIN_IND )
  {
    pstJoinMessage = ( struct ZbNlmeJoinIndT * )pMessage;

    switch ( pstJoinMessage->rejoinNetwork )
    {
      case ZB_NWK_REJOIN_TYPE_ASSOC :
      case ZB_NWK_REJOIN_TYPE_ORPHAN :
      case ZB_NWK_REJOIN_TYPE_NWKREJOIN :
      case ZB_NWK_REJOIN_TYPE_NWKCOMMISS_JOIN :
      case ZB_NWK_REJOIN_TYPE_NWKCOMMISS_REJOIN :
          /* A new Device has Join Network at MAC/NWK level */
          APP_ZIGBEE_SetNewDevice( pstJoinMessage->nwkAddr, pstJoinMessage->extAddr, pstJoinMessage->capabilityInfo );
          break;

      default :
          break;
    }
  }

