STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA55CG/Applications/Zigbee/Zigbee_OnOff_Client_Router_FreeRtos/STM32_WPAN/App/app_zigbee.c
  // Intentional INFINITE_LOOP
  // coverity[no_escape]
  while (1U == 1U)
  {
    /* USER CODE BEGIN APP_ZIGBEE_TraceError */
    APP_LED_TOGGLE( LED_JOIN );
    HAL_Delay( 500U );
    APP_LED_TOGGLE( LED_WORK );
    HAL_Delay( 500U );

    /* USER CODE END APP_ZIGBEE_TraceError */
  }
}

/**
 * @brief  Treat Serial commands and test if it's a Request on Install Code.
 *
 * @param  pRxBuffer      Pointer on received data from USART.
 * @param  iRxBufferSize  Number of received data.
 * @retval None
 */
void APP_ZIGBEE_SerialCommandInstallCode( uint8_t * pRxBuffer, uint16_t iRxBufferSize )
{
  uint8_t   szInstallCode[ZB_SEC_KEYSIZE + 2u], szByte[9];
  uint16_t  iBufferIndex, iIndex, iSize, iNormalSize;
  uint64_t  dlExtendedAddress = 0;

  /* Threat USART Command for Install Code */
  if ( strncmp( (char *)pRxBuffer, "IC:", 3 ) == 0 )
  {
    /* Treat Command IC:<ExtendedAddress>:<InstallCode + CRC><CR> */
    iSize = strlen( (char *)pRxBuffer );
    iNormalSize = 3u + ( sizeof(dlExtendedAddress) * 2u ) + 1u + ( sizeof(szInstallCode) * 2u );
    if ( iSize == iNormalSize )
    {
      iBufferIndex = 3u;
      memcpy( szByte, &pRxBuffer[iBufferIndex], 8u );
      szByte[8] = 0;
      dlExtendedAddress = (uint64_t)( strtoul( (char *)szByte, NULL, 16u ) ) << 32u;

      iBufferIndex += 8u;
      memcpy( szByte, &pRxBuffer[iBufferIndex], 8u );
      dlExtendedAddress += (uint64_t)( strtoul( (char *)szByte, NULL, 16u ) );

      iBufferIndex += ( 8u + 1u );
      szByte[2] = 0;
      for ( iIndex = 0; iIndex < sizeof(szInstallCode); iIndex++ )
      {
        szByte[0] = pRxBuffer[iBufferIndex++];
        szByte[1] = pRxBuffer[iBufferIndex++];
        szInstallCode[iIndex] = (uint8_t)strtoul( (char *)szByte, NULL, 16 );
      }

      LOG_INFO_APP( "Command Install Code with ExtAddress " LOG_DISPLAY64() " and InstallCode %s.",
                   LOG_NUMBER64(dlExtendedAddress), &pRxBuffer[3u + ( sizeof(dlExtendedAddress) * 2u ) + 1u] );
      if ( AppZbUtil_AddDeviceWithInstallCode( stZigbeeAppInfo.pstZigbee, dlExtendedAddress, szInstallCode ) != false )
      {
        APP_ZIGBEE_PermitJoin( 30 );
      }
    }
    else
    {
      LOG_ERROR_APP( "Bad Length : %d instead %d.", iSize, iNormalSize );
    }
  }
}
